Actually, should have provided this:
```
$ aws-vault exec deciphernow-covidapihub -- terraform plan
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/covidapihub/terraform-covidapihub/runs/run-xtWtpcJmqa3rvdF4

Waiting for the plan to start...

Terraform v0.12.24
Configuring remote state backend...
Initializing Terraform configuration...
2020/06/04 16:51:03 [DEBUG] Using modified User-Agent: Terraform/0.12.24 TFC/901765b936
Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.

module.github.github_membership.member["chrisbsmith"]: Refreshing state... [id=covidapihub:chrisbsmith]
module.github.github_repository.repository["terraform-covidapihub"]: Refreshing state... [id=terraform-covidapihub]
module.github.github_repository.repository["datasource-inshift"]: Refreshing state... [id=datasource-inshift]
module.github.github_membership.member["kaitmore"]: Refreshing state... [id=covidapihub:kaitmore]
module.github.github_branch_protection.master["datasource-inshift"]: Refreshing state... [id=datasource-inshift:master]
module.eks.aws_iam_role.worker: Refreshing state... [id=eks-worker-covidapihub]
module.eks.aws_iam_role.master: Refreshing state... [id=eks-master-covidapihub]
module.eks.aws_vpc.cluster: Refreshing state... [id=vpc-0f50416e9b4e0810e]
module.eks.aws_iam_role_policy_attachment.cni: Refreshing state... [id=eks-worker-covidapihub-20200407141633361200000001]
module.eks.aws_iam_role_policy_attachment.worker: Refreshing state... [id=eks-worker-covidapihub-20200407141633362900000002]
module.eks.aws_iam_role_policy_attachment.registry: Refreshing state... [id=eks-worker-covidapihub-20200407141633407200000005]
module.eks.aws_iam_role_policy_attachment.cluster: Refreshing state... [id=eks-master-covidapihub-20200407141633380800000004]
module.eks.aws_iam_role_policy_attachment.service: Refreshing state... [id=eks-master-covidapihub-20200407141633373900000003]
module.eks.aws_route_table.egress: Refreshing state... [id=rtb-01dcc567b94cce0c1]
module.eks.aws_subnet.master[1]: Refreshing state... [id=subnet-0982cd3d6b04a6352]
module.eks.aws_internet_gateway.egress: Refreshing state... [id=igw-02cb5b17938c6df72]
module.eks.aws_subnet.worker[1]: Refreshing state... [id=subnet-0dd519acb8dcf5ed2]
module.eks.aws_subnet.master[2]: Refreshing state... [id=subnet-08cd9b1deb18e56c2]
module.eks.aws_subnet.master[0]: Refreshing state... [id=subnet-00c121398d3420605]
module.eks.aws_subnet.worker[0]: Refreshing state... [id=subnet-042777fc720e26c1e]
module.eks.aws_subnet.worker[2]: Refreshing state... [id=subnet-020841a78b640e827]
module.eks.aws_route.egress: Refreshing state... [id=r-rtb-01dcc567b94cce0c11080289494]
module.eks.aws_route_table_association.worker-egress[2]: Refreshing state... [id=rtbassoc-05d5fa4b90321919a]
module.eks.aws_route_table_association.master-egress[0]: Refreshing state... [id=rtbassoc-04b110d0bc373951f]
module.eks.aws_route_table_association.master-egress[1]: Refreshing state... [id=rtbassoc-0630fa1c3de3121d0]
module.eks.aws_route_table_association.worker-egress[0]: Refreshing state... [id=rtbassoc-075b9906b6510e137]
module.eks.aws_route_table_association.master-egress[2]: Refreshing state... [id=rtbassoc-0329fee3c3503b5a1]
module.eks.aws_route_table_association.worker-egress[1]: Refreshing state... [id=rtbassoc-0f23487a5d88989c5]
module.eks.aws_eks_cluster.cluster: Refreshing state... [id=covidapihub]
module.eks.aws_eks_node_group.cluster["m5-general"]: Refreshing state... [id=covidapihub:m5-general]

------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.github.github_branch_protection.master["terraform-covidapihub"] will be created
  + resource "github_branch_protection" "master" {
      + branch                 = "master"
      + enforce_admins         = true
      + etag                   = (known after apply)
      + id                     = (known after apply)
      + repository             = "terraform-covidapihub"
      + require_signed_commits = false

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = true
          + require_code_owner_reviews      = true
          + required_approving_review_count = 1
        }
    }

  # module.github.github_repository.repository["datasource-inshift"] must be replaced
-/+ resource "github_repository" "repository" {
        allow_merge_commit     = false
        allow_rebase_merge     = false
        allow_squash_merge     = true
        archived               = false
      ~ auto_init              = true -> false # forces replacement
      ~ default_branch         = "master" -> (known after apply)
        delete_branch_on_merge = false
      ~ etag                   = "W/\"7c8e73d88138a83372fe38733be1a8d3\"" -> (known after apply)
      ~ full_name              = "covidapihub/datasource-inshift" -> (known after apply)
      ~ git_clone_url          = "git://github.com/covidapihub/datasource-inshift.git" -> (known after apply)
        has_downloads          = false
        has_issues             = true
        has_projects           = false
        has_wiki               = false
      ~ html_url               = "https://github.com/covidapihub/datasource-inshift" -> (known after apply)
      ~ http_clone_url         = "https://github.com/covidapihub/datasource-inshift.git" -> (known after apply)
      ~ id                     = "datasource-inshift" -> (known after apply)
      - is_template            = false -> null
        name                   = "datasource-inshift"
      ~ node_id                = "MDEwOlJlcG9zaXRvcnkyNjEyNjMzMjk=" -> (known after apply)
        private                = false
      ~ ssh_clone_url          = "git@github.com:covidapihub/datasource-inshift.git" -> (known after apply)
      ~ svn_url                = "https://github.com/covidapihub/datasource-inshift" -> (known after apply)
      - topics                 = [] -> null
    }

  # module.github.github_repository.repository["terraform-covidapihub"] will be updated in-place
  ~ resource "github_repository" "repository" {
      ~ allow_merge_commit     = true -> false
      ~ allow_rebase_merge     = true -> false
        allow_squash_merge     = true
        archived               = false
        auto_init              = false
        default_branch         = "master"
        delete_branch_on_merge = false
      - description            = "This repository is used to manage the CovidAPIHub GitHub Organization." -> null
        etag                   = "W/\"9090a7dc34d775048f216123b0a89ee3\""
        full_name              = "covidapihub/terraform-covidapihub"
        git_clone_url          = "git://github.com/covidapihub/terraform-covidapihub.git"
      ~ has_downloads          = true -> false
        has_issues             = true
      ~ has_projects           = true -> false
      ~ has_wiki               = true -> false
        html_url               = "https://github.com/covidapihub/terraform-covidapihub"
        http_clone_url         = "https://github.com/covidapihub/terraform-covidapihub.git"
        id                     = "terraform-covidapihub"
        is_template            = false
        name                   = "terraform-covidapihub"
        node_id                = "MDEwOlJlcG9zaXRvcnkyNjEyMjQ4MjM="
        private                = false
        ssh_clone_url          = "git@github.com:covidapihub/terraform-covidapihub.git"
        svn_url                = "https://github.com/covidapihub/terraform-covidapihub"
        topics                 = []
    }

Plan: 2 to add, 1 to change, 1 to destroy.
```